# Reading and Writing Data in Text Format

Pandas has number of features for reading the tabular data as DataFrame object.

In [1]:
import csv

In [2]:
import pandas as pd

In [3]:
def make_csv(name, data):
    csv_ext = 'csv'
    if csv_ext not in name.split("."):
        print("Can't create a csv file without csv extension.")
    with open(name, 'w', newline='') as f:
        writer = csv.writer(f)
        
        for d in data:
            writer.writerow(d)
        f.close()

In [4]:
data = [['a', 'b', 'c', 'd', 'message'], [1, 2, 3, 4, 'hello'], [5, 6, 7, 8, 'world']]
make_csv('ex1.csv', data)

In [5]:
pd.read_csv('ex1.csv')

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [6]:
pd.read_table('ex1.csv', sep=',')

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In above code we used delimiter `sep=','` in **pandas's** `read_table` function

Sometimes a file can't have any header.

In [7]:
data = [[1, 2, 3, 4, 'hello'], [5, 6, 7, 8, 'world'], [9, 10, 11, 12, 'foo']]
make_csv('ex2.csv', data)

In [8]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

As you can see we only having DataFrame's value, with column index 0 to 4.

We can also assign default column names through pandas.

In [9]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a', 'b', 'c', 'd', 'messgage']

pd.read_csv('ex2.csv', names=names)

   a   b   c   d messgage
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [11]:
data = [['key1', 'key2', 'value1', 'value2'], ['one', 'a', 1, 2], 
        ['one', 'b', 3, 4], ['one', 'c', 5, 6], ['one', 'd', 7, 8], 
        ['two','a',9,10], ['two','b',11,12], ['two','c',13,14], ['two','d',15,16]]
make_csv('csv_mindex.csv', data)

In [12]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
def make_txt(name, data):
    txt_ext = 'txt'
    if txt_ext not in name.split("."):
        print("It's not a text file.")
        return -1
    with open(name, 'w', newline='') as f:
        for d in data:
            f.write(d)
        f.close()

In [15]:
make_csv('name', names)

Can't create a csv file without csv extension.

We can also skip rows with `skiprows=[]` parameter, in `read_csv`

In [16]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
pd.read_csv('csv_mindex.csv', skiprows=[0,2])

   one  a   1   2
0  one  c   5   6
1  one  d   7   8
2  two  a   9  10
3  two  b  11  12
4  two  c  13  14
5  two  d  15  16

In [18]:
pd.read_csv('csv_mindex.csv')

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [19]:
import numpy as np
data = [['something', 'a', 'b', 'c', 'd', 'message'], ['one', 1, 2, 3, 4, np.nan],
        ['two', 5, 6, np.nan, 8, 'world'], ['three', 9, 10, 11, 12, 'foo']]

In [20]:
make_csv('ex5.csv', data)

In [21]:
result = pd.read_csv('ex5.csv')

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

So in above section I have created a DataFrame with NaN value, Now we are going to handle these values.

###### Handling missing data in a DataFrame

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [24]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
sentinels = {'message':['foo', 'NA'], 'something':['two']}

In [27]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

As you can see for youself that in column 'something' and 'message' we have changed values from some value to 'NaN' by sentinals in `na_values`

## Reading Text Files in Pieces

In [28]:
# This is Pandas's display settings for more compact view.
pd.options.display.max_rows = 10

In [29]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
data = np.random.randn(9996, 4)
make_csv('ex6.csv', data)

In [31]:
result = pd.read_csv('ex6.csv', names=['one', 'two', 'three', 'four'])

In [32]:
result

           one       two     three      four
0     0.017761  1.028724 -1.675331  0.611791
1    -0.954483 -1.585254 -0.249925  1.324322
2    -0.754619 -0.416577  0.882195 -0.166458
3     0.996927  2.881017  1.015584 -1.429905
4     1.318081 -0.512446  2.250100  0.603312
...        ...       ...       ...       ...
9991  0.297029  0.071961  0.289571 -1.399910
9992  0.707555 -0.070285 -2.039146 -1.325286
9993 -0.729681  0.415220 -0.403048  0.054760
9994 -0.020045  0.315453  0.123914  2.331996
9995 -0.012359 -0.318125  0.597419  1.049453

[9996 rows x 4 columns]

In [33]:
pd.read_csv('ex6.csv', nrows=9, names=['one', 'two', 'three', 'four'])

        one       two     three      four
0  0.017761  1.028724 -1.675331  0.611791
1 -0.954483 -1.585254 -0.249925  1.324322
2 -0.754619 -0.416577  0.882195 -0.166458
3  0.996927  2.881017  1.015584 -1.429905
4  1.318081 -0.512446  2.250100  0.603312
5 -0.964744 -0.281897 -2.247672  0.935003
6  0.474083  0.813983  0.348343 -0.423669
7  0.172998  0.771608  0.108067 -1.139277
8  1.164030 -0.243810 -0.509103  0.488804

In [34]:
result

           one       two     three      four
0     0.017761  1.028724 -1.675331  0.611791
1    -0.954483 -1.585254 -0.249925  1.324322
2    -0.754619 -0.416577  0.882195 -0.166458
3     0.996927  2.881017  1.015584 -1.429905
4     1.318081 -0.512446  2.250100  0.603312
...        ...       ...       ...       ...
9991  0.297029  0.071961  0.289571 -1.399910
9992  0.707555 -0.070285 -2.039146 -1.325286
9993 -0.729681  0.415220 -0.403048  0.054760
9994 -0.020045  0.315453  0.123914  2.331996
9995 -0.012359 -0.318125  0.597419  1.049453

[9996 rows x 4 columns]

**To read a file in pieces, specify a `chunksize` as number of rows**

In [35]:
pd.read_csv('ex6.csv', chunksize=1000)

`TextParser` object returned by `read_csv` allows you ti iterate over the parts of the file according to the chunksize.

In [36]:
chunker = pd.read_csv('ex6.csv', chunksize=1000, 
                      names=['one', 'two', 'three', 'four'])

In [37]:
tot = pd.Series([])

for piece in chunker:
    tot = tot.add(piece['one'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [38]:
tot

 4.049887    1.0
-0.423394    1.0
-0.420344    1.0
-0.420726    1.0
-0.422172    1.0
            ...
 0.446978    1.0
 0.446841    1.0
 0.446491    1.0
 0.446402    1.0
-3.578935    1.0
Length: 9996, dtype: float64

## Writing Data to text Format

In [39]:
data = pd.read_csv('ex5.csv')

In [40]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
data.to_csv('out.csv')

In [42]:
import sys

In [43]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [44]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

**Without Index and changed columns**

In [45]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

**Series also has a `to_csv` method**

In [46]:
dates = pd.date_range('1/1/2000', periods=7)

In [47]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [48]:
ts = pd.Series(np.arange(7), index=dates)

In [49]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [50]:
ts.to_csv('tseries.csv')

## Working with Delimited Formats

In [51]:
data = [["a", "b", "c"], ["1", "2", "3"], ["1", "2", "3"]]
make_csv('ex7.csv', data)

In [52]:
f = open('ex7.csv')

In [53]:
reader = csv.reader(f)

In [54]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [55]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [56]:
header, values = lines[0], lines[1:]

In [57]:
data_dict ={h:v for h, v in zip(header, zip(*values))}

In [58]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

To define a new format with a differnent delimiter, string quoting convention, or line terminator, we define a simple subclass of `csv.Dialect`

In [59]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [60]:
f = open('ex7.csv', 'r')

In [61]:
f

In [62]:
list(f)

['a,b,c\n', '1,2,3\n', '1,2,3\n']

In [63]:
reader = csv.reader(f, dialect=my_dialect)

In [64]:
reader = csv.reader(f, delimiter='|')

In [65]:
reader

## JSON Data

JSON (JavaScript Object Notation) is a standard format for sending data by HTTP request between web browsers and other applications.

In [66]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

*Convert JSON string to Python form*, by `json.loads`

In [67]:
import json

In [68]:
result = json.loads(obj)

In [69]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

To convert back to JSON

In [70]:
asjson = json.dumps(result)

In [71]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [72]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])

In [73]:
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [74]:
def make_json(name, data):
    json_ext = 'json'
    if json_ext not in name.split("."):
        print("Can't create a json file without '.json' extension.")
    with open(name, 'w', newline='') as f:
        for d in data:
            f.write(json.dumps(d))
        f.close()

In [75]:
data = [{"a": 1, "b": 2, "c": 3},
        {"a": 4, "b": 5, "c": 6},
        {"a": 7, "b": 8, "c": 9}]
make_json('example.json', data)

## Using HDF5 Format

**HDF5** is a large quantities of sceintifc array data. It's available as **C library**.

*HDF5* stands for **Hierarchical data format.**

In [59]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [61]:
store = pd.HDFStore('mydata.h5')

In [64]:
store['obj1'] = frame

In [65]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [66]:
store['obj1']

           a
0   1.150648
1  -0.587149
2   0.288443
3   0.945414
4  -1.066638
..       ...
95 -0.939713
96 -1.248292
97  1.268197
98 -0.182969
99 -0.135846

[100 rows x 1 columns]

In [67]:
store.put('obj2', frame, format='table')

In [68]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.029961
11  0.374533
12 -1.895958
13 -0.075255
14  0.259630
15  0.765315

### Interacting with Web APIs

In [69]:
import requests

In [70]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [71]:
resp = requests.get(url)

In [72]:
data = resp.json()

In [73]:
data[0]['title']

'BUG: Fix segfault in Categorical.set_categories'

In [76]:
data[1]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/24679',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/24679/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/24679/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/24679/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/24679',
 'id': 397180542,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0MjQzMTkwMjY4',
 'number': 24679,
 'title': 'DOC: Fixes to the whatsnew structure',
 'user': {'login': 'datapythonista',
  'id': 10058240,
  'node_id': 'MDQ6VXNlcjEwMDU4MjQw',
  'avatar_url': 'https://avatars2.githubusercontent.com/u/10058240?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/datapythonista',
  'html_url': 'https://github.com/datapythonista',
  'followers_url': 'https://api.github.com/users/datapythonista/followers',
  'following_url': 'https://api.github.com/users/datapythonista/following{/other_user}',
  'gists_url': 'https://api.github.com/users/datapythonista/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/datapythonista/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/datapythonista/subscriptions',
  'organizations_url': 'https://api.github.com/users/datapythonista/orgs',
  'repos_url': 'https://api.github.com/users/datapythonista/repos',
  'events_url': 'https://api.github.com/users/datapythonista/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/datapythonista/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 134699,
   'node_id': 'MDU6TGFiZWwxMzQ2OTk=',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Docs',
   'name': 'Docs',
   'color': '3465A4',
   'default': False}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 0,
 'created_at': '2019-01-09T02:08:38Z',
 'updated_at': '2019-01-09T02:09:20Z',
 'closed_at': None,
 'author_association': 'MEMBER',
 'pull_request': {'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/24679',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/24679',
  'diff_url': 'https://github.com/pandas-dev/pandas/pull/24679.diff',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/24679.patch'},
 'body': '- [X] xref #24499\r\n- [ ] tests added / passed\r\n- [ ] passes `git diff upstream/master -u -- "*.py" | flake8 --diff`\r\n- [ ] whatsnew entry\r\n\r\nChanges in this PR:\r\n- Moving `releases.rst` to `whatsnew/index.rst`, which is more consistent with the new structure of the documentation\r\n- Sorting the `whatsnew/index` from the newest to the oldest (was from newest to oldest for the major version, but inside them, the minor versions were sorted from oldest to newest, except for 0.23).\r\n\r\nCC: @TomAugspurger \r\n'}

## Interacting with Databases

In [77]:
import sqlite3

In [79]:
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
    c REAL, d INTEGER);
"""

In [80]:
con = sqlite3.connect('mydata.sqlite')

In [81]:
con.execute(query)

In [82]:
con.commit()

In [83]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacrmento', 'California', 1.7, 5)
       ]

In [84]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [85]:
con.executemany(stmt, data)

In [86]:
con.commit()

In [87]:
cursor = con.execute('select * from test')

In [88]:
rows = cursor.fetchall()

In [89]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacrmento', 'California', 1.7, 5)]

In [90]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [91]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2    Sacrmento  California  1.70  5

In [93]:
import sqlalchemy as sqla

In [94]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [95]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2    Sacrmento  California  1.70  5